In [247]:
import pandas as pd

In [248]:
import numpy as np

In [249]:
df = pd.DataFrame({'From_To':['LoNDon_paris','MAdrid_miLAN','londON_StockhOlm','Budapest_paRis','Brussels_londOn'],'FlightNumber':[10045,np.nan,10065,np.nan,10085],'RecentDelays':[[23,47],[],[24,43,87],[13],[67,32]],'Airline':['KLM(!)','<Air France>(12)','(British Airways.)','12.Air France',"'Swiss Air'"]})

In [250]:
df

            From_To  FlightNumber  RecentDelays             Airline
0      LoNDon_paris       10045.0      [23, 47]              KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France>(12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways.)
3    Budapest_paRis           NaN          [13]       12.Air France
4   Brussels_londOn       10085.0      [67, 32]         'Swiss Air'

Task 1

Filling the missing values

In [251]:
start = df['FlightNumber'][0]
FlightNumber=[]

In [252]:
for i in range(df.shape[0]):
    FlightNumber.append(start)
    start = start +10

In [253]:
FlightNumber

[10045.0, 10055.0, 10065.0, 10075.0, 10085.0]

In [254]:
df['FlightNumber'] = FlightNumber

In [255]:
df

            From_To  FlightNumber  RecentDelays             Airline
0      LoNDon_paris       10045.0      [23, 47]              KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France>(12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways.)
3    Budapest_paRis       10075.0          [13]       12.Air France
4   Brussels_londOn       10085.0      [67, 32]         'Swiss Air'

In [256]:
df['FlightNumber'] = df['FlightNumber'].astype(int)

In [257]:
df

            From_To  FlightNumber  RecentDelays             Airline
0      LoNDon_paris         10045      [23, 47]              KLM(!)
1      MAdrid_miLAN         10055            []    <Air France>(12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways.)
3    Budapest_paRis         10075          [13]       12.Air France
4   Brussels_londOn         10085      [67, 32]         'Swiss Air'

Task 2

Splitting the colum name

In [258]:
temp_df = df[['From_To']]

In [259]:
temp_df

            From_To
0      LoNDon_paris
1      MAdrid_miLAN
2  londON_StockhOlm
3    Budapest_paRis
4   Brussels_londOn

In [260]:
temp_df[['From','To']]= temp['From_To'].str.split("_", expand=True)

C:\Users\raghu\anaconda3\lib\site-packages\pandas\core\frame.py:2963: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[k1] = value[k2]

In [261]:
temp_df.drop('From_To', axis=1, inplace=True)

C:\Users\raghu\anaconda3\lib\site-packages\pandas\core\frame.py:3990: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

In [262]:
temp_df['From']

0      LoNDon
1      MAdrid
2      londON
3    Budapest
4    Brussels
Name: From, dtype: object

In [263]:
temp_df['To']

0        paris
1        miLAN
2    StockhOlm
3        paRis
4       londOn
Name: To, dtype: object

In [264]:
temp_df

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      paRis
4  Brussels     londOn

Task 3

Applying String Capitalization

In [265]:
temp_df['From'] = temp_df['From'].str.capitalize()

<ipython-input-265-00335c939838>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  temp_df['From'] = temp_df['From'].str.capitalize()

In [266]:
temp_df['To'] = temp_df['To'].str.capitalize()

<ipython-input-266-167000c0e806>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  temp_df['To'] = temp_df['To'].str.capitalize()

In [229]:
temp_df

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

Task 4

Removing the column from original df

In [267]:
 df.drop('From_To', axis=1, inplace=True)

In [268]:
df['From'] = temp_df['From']
df['To'] = temp_df['To']

In [269]:
df

   FlightNumber  RecentDelays             Airline      From         To
0         10045      [23, 47]              KLM(!)    London      Paris
1         10055            []    <Air France>(12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways.)    London  Stockholm
3         10075          [13]       12.Air France  Budapest      Paris
4         10085      [67, 32]         'Swiss Air'  Brussels     London

Task 5

Replacing recent delays

In [270]:
delay_df = pd.DataFrame(df['RecentDelays'].values.tolist()).rename(columns= lambda x: 'delay_{}'.format(x+1))

In [271]:
delay_df

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [272]:
df = df.join(delay_df)

In [273]:
df

,FlightNumber,RecentDelays,Airline,From,To,delay_1,delay_2,delay_3
0,10045,"[23, 47]",KLM(!),London,Paris,23.0,47.0,NaN
1,10055,[],<Air France>(12),Madrid,Milan,NaN,NaN,NaN
2,10065,"[24, 43, 87]",(British Airways.),London,Stockholm,24.0,43.0,87.0
3,10075,[13],12.Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,"[67, 32]",'Swiss Air',Brussels,London,67.0,32.0,NaN

In [274]:
df.drop('RecentDelays', axis=1, inplace = True)

In [275]:
df

,FlightNumber,Airline,From,To,delay_1,delay_2,delay_3
0,10045,KLM(!),London,Paris,23.0,47.0,NaN
1,10055,<Air France>(12),Madrid,Milan,NaN,NaN,NaN
2,10065,(British Airways.),London,Stockholm,24.0,43.0,87.0
3,10075,12.Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,'Swiss Air',Brussels,London,67.0,32.0,NaN